% целевая функция: 
% F = 2100*(a1+2*a2+3*a3) + 3600*(b1+2*b2+3*b3) + 3780*(c1+2*c2+3*c3) -> max
% ограничения:
% 10000*(a1+a2+a3) + 20000*(b1+b2+b3) + 23000*(c1+c2+c3) <= 600000
% a1 + a2 + a3 + b1 + b2 + b3 + c1 + c2 + c3 <= 30;
% a1 + 2*a2 + 3*a3 + 2*b1 + 4*b2 + 6*b3 + 2*c1 + 4*c2 + 6*c3 <= 145
% a1,a2,a3,b1,b2,b3,c1,c2,c3 >= 0

% целевая функция
F=-[2100. 2100. 2100. 3600. 3600. 3600. 3780. 3780. 3780.]; 

% коээфиценты в ограничениях
A=[10000 10000 10000 20000 20000 20000 23000 23000 23000; 1 1 1 1 1 1 1 1 1; 1 2 3 2 4 6 2 4 6]; 

% правые части в ограничениях
B=[600000; 30; 145];

lb = zeros(9, 1);

x = linprog(F,A,B, [], [], lb)
